Revit 2027 API
SymbolicCurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SymbolicCurveArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As SymbolicCurveArrayIterator
public:
virtual SymbolicCurveArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> SymbolicCurveArrayIterator
override ForwardIterator : unit -> SymbolicCurveArrayIterator
Return Value
SymbolicCurveArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace